LuaQ     @iMeepo.lua           -b     A@  @    A€  @    AŔ  @    A  @    A@ @    A€ @    AŔ @   @B €€ K€B ÁŔ  FAC \@€K€B Á€ Á FAC \@€K€B Á  A FAC \@€K€B Á€ Á FAC \@€K€B Á  A FAC \@€K€E \@ FŔB GŔ F€C G  F€D G@ F D G€ F E GŔ B     Á   B  Š  Â€ B ‚GÂGHJ  Š€Á  A  Á  A ˘B€Ę  A âB C HĂ Á	 ‚’N“ J   AÄ	 
 ÁD
 …
 AĹ
  ÁE † AĆ  Ę 
 AG ‡ "G J Ç Á
 bG Š ÁG
 
 ˘G Ę Č
 A âG 
 AH  "H J Č Á bH Š ÁH ‰ ˘H Ę É A	 âH 
	 AI ‰ "I J	 É Á	 bI âF 
 J‡ …‡ ÁÇ  AH ś‡ I‡‡˘…‡ ÁÇ  AH ś‡ I‡Ą…‡ ÁÇ  AH ś‡ I‡§IĘ¨IÇI©IŐ©I‡ËŞIU«IÇ«IU¬Š‡ Ĺ‡ H A H Ü‡ ‰Ç‡˘Ĺ‡ Č A H Ü‡ ‰ÇĄĹ‡ H A Č Ü‡ ‰Ç§‰Ę¨‰J©‰Ő©‰GĘŞ‰U«‰Ç«‰U¬Ę‡  A H ÁČ  É˘ A Č ÁČ  ÉĄ A H ÁČ  É§ÉĘ¨ÉGJ©ÉŐ©É‡ËŞÉU«ÉÇ«ÉU¬
 E  ÁČ É \ 	H˘E  ÁH É \ 	HĄE  ÁČ É \ 	H§	Ę¨	J©	Ő©	HĘŞ	U«	Ç«	U¬J … Á I AÉ ś I˘… Á É AÉ ś IĄ… Á I AÉ ś I§IĘ¨IČJ©IŐ©IČÉŞIU«IÇ«IU¬ŠČ Ĺ ‰ AÉ É Ü ‰Č˘Ĺ 	 AI ‰ Ü ‰ČĄĹ É A	 É Ü ‰Č§‰Ę¨‰K©‰Ő©‰HŢŞ‰U«‰Ç«‰Č^˝‰U¬Ę ‰ A	 I ÁÉ ‰ É‰˘‰ A‰ É ÁÉ ‰ É	Ą‰ A	  I  ÁÉ ‰ É	§ÉHĘ¨ÉHK©ÉŐ©ÉËŞÉU«ÉÇ«ÉU¬
‰ E‰ ‰  ÁÉ  Ę \‰ 	I‰˘E‰ 	! ÁI! Ę \‰ 	I	ĄE‰ ‰! ÁÉ! Ę \‰ 	I	§	IĘ¨	‰K©		Ő©	IĘŞ		U«		Ç«		U¬J‰ …‰ Á	" J" AJ ś‰ I‰‰˘…‰ Á‰" Ę" A
# ś‰ I‰	Ą…‰ ÁI# Š# AJ ś‰ I‰	§IIĘ¨IÉK©I	Ő©IIĘŞI	U«I	Ç«I	U¬Š‰ Ĺ‰ Ę# A
$ Ę Ü‰ ‰É‰˘Ĺ‰ J$ AŠ$ Ę Ü‰ ‰É	ĄĹ‰ Ę$ A
% Ę Ü‰ ‰É	§‰IĘ¨‰	L©‰	Ő©‰ÉÉŞ‰	U«‰	Ç«‰	U¬Ę‰ Š AJ% Š% ÁĘ Š É	Š˘Š AĘ% 
& ÁJ& Š É	
ĄŠ AŠ& Ę& ÁĘ Š É	
§ÉIĘ¨É	g©É	Ő©É‰ËŞÉ	U«É	Ç«É	U¬
Ę EŠ J' ÁŠ' K \Š 	JŠ˘EŠ Ę' Á
( K \Š 	J
ĄEŠ J( ÁŠ( K \Š 	J
§	JĘ¨	J^©	
Ő©	JŢŞ	
U«	
Ç«	Ę^˝	
U¬"G d       €  €     €	     €  €
GÇ( dG       €     €     €        €	     €   
  €
      	     €  €   
G) d‡    €   €     €     €     €        €  €   G‡ dÇ    €     €     €     €        €  €     € GG) E‡) KÇéĹ* H) \G E‡) KÇéĹG*  \G d G‡* dG GÇ* d‡ G+ dÇ      €  €	GG+ d    G‡+ dG         €	GÇ+ d‡ G, dÇ    GG, d    G‡, dG    GÇ, d‡    G- dÇ      €
  €      	GG- d G‡- dG    GÇ- d‡    G. dÇ    GG. d    G‡. dG    GÇ. d‡      €G/ dÇ      €GG/ d G‡/ dG      €     €	  €  €GÇ/  € Ŕ      require    libs.ScriptConfig    libs.Utils    libs.TargetFind    libs.Animations 
   libs.EasyHUD    libs.SkillShot    libs.AbilityDamage 
   ScriptConfig    new 
   SetParameter 	   ChaseKey    N    TYPE_HOTKEY    FarmJungleKey    B    AllMeeposIdle    V    Debug    P    Lane    L    Load    mainkey 	   farmJkey 	   debugKey    idleKey    laneKey            client    screenSize    x       ž@   drawMgr    CreateFont    F14    Tahoma       .@     Ŕ‚@      đ?       @      @      @      @      @      @       @      "@      $@   Idling       đż   Chasing    ˙ă·A   Farming and Stacking Jungle   Ŕ˙}vŮA
   Farming Lane   €˙˙şÉA   Laninng   ŕ˙ŕçA   Pushing   ŕ~îA   Healing   ŕ`íďA	   Escaping   ŕ_ŘĐďA   Poofing Out    ŕ?d`A   Moving   ŕ ŤäA	   position    Vector      ¬‘Ŕ     ŻŔ     Ŕ_@   stackPosition {®GárźŔ{®Ga–®Ŕ      `@
   waitPosition      Ś¤Ŕq=
×ă°Ŕ   team    id    farmed     lvlReq    visible    visTime 	   stacking      ŕvŔ     §ŔnŔ±€Ŕ®Gáz
śŔ     Ŕ€@     r§Ŕ      p@ÍĚĚĚĚ™@…ëQ¸ŇŞŔö(\ŹÂ´”@…ëQ8ôłŔ®Gáz@{®Ga©°Ŕ     l¨@     ŢŞŔ
×Łp}:±@     "ŻŔ     “Ş@q=
×c‰°ŔĂő(\®§@Ăő(\€±Ŕ¸…ëQň—@q=
×ă“´Ŕ…ëQ8÷¦@ěQ¸…QµŔ     ^§Ŕ     ŕg@     6«Ŕ     ›Ŕ     ŕn@     ŁŔ     @vŔ      (@	   ancients      <’@     ľ©@{®GáÖ@)\ŹÂőŁ±@     Ź@     ¬@     €nŔ     Z¬@®GázI’Ŕ¤p=
—ĺ±@     €Ŕ     í˛@     ĐŔ     Ą@     X”Ŕ¸…ëŃŇ¬@ţÔxé&
a@     L—Ŕ     T§@®Gáz«¨Ŕ)\ŹÂu{±@33333Ŕ©Ŕ®Gáz„µ@     ¨Ŕ     <ł@     ±Ŕ     8¬@®GázĄ§Ŕ{®Ga×­@×Łp=
‹`@     6ŻŔ      Ż@      &@     tŻ@•C‹/†ŔR¸…ëhˇ@…ëQ¸[Ŕ     d¨@ö(\ŹÂ’Ŕ   Key    Main    Close    script    RegisterEvent    EVENT_CLOSE    EVENT_TICK    canCast    willHit    chainEarthbind    collectMeepos    earthbindAnimation    anyMeepoIsFarming    getBlockPositions    isFacingAnyMeepo    anyMeepoisNear    getClosest    getAliveNumber    drawStates    haveHealingItems    IsInDanger    getFarmingMeeposCamp    getClosestCamp    getFarrestMeepo    getNearVictims    useTP    IncomingDamage 
   SwitchTreads    OrbWalk        `   †    µ   …   €  Ŕ€…@  †€@š@  Ŕ€…@  †Ŕ@š@  Ŕ€…  †@AX€AŔ €…Ŕ ś€€ š@    € € …  €€  €…@ ‹€Bś€ ĆŔB @€@€D  †BCF‚‚Z   
€D  †BCF‚‚F‚Ă„€ W€‚€€D  †BCF‚‚F‚Ă„ W€‚Ŕ€D  †BCF‚‚F‚Ă„€W€‚ €D  †BCF‚‚F‚Ă„ W€‚@€D  †BCF‚‚„ I‚‡€€D  †BCF‚‚F‚Ă„ W€‚€€D  †BCF‚‚F‚Ă„€€‚ €D  †BCF‚‚„ I‚‡!  ŔđŔ€…Ŕ €€ Ŕ€…  Ä   ś  €Ä  BCĆ‚ É‡ˇ€   ţ €…@ €€ @€…@ ‹€Bś€ ĆŔB @€€€D  †BCF‚‚Z  @€D  †BCF‚‚F‚Ă„€ W€‚€€D  †BCF‚‚F‚Ă„ W€‚Ŕ€D  †BCF‚‚F‚Ă„€W€‚ €D  †BCF‚‚F‚Ă„€W€‚@€D  †BCF‚‚„€I‚‡Ŕ€D  †BCF‚‚F‚Ă„€€‚ €D  †BCF‚‚„ I‚‡!  €ňŔ€…€ €€  €…Ŕ Ĺ  Ü€€ Ó €ś@  €       KEY_UP    client    chat    console    Animations 	   maxCount       đ?   PlayingGame 	   farmJkey    entityList    GetMyPlayer 
   selection    ipairs    handle    state    idleKey    pairs    laneKey 	   debugKey    SetDebugState    IsDebugActive                     Š   |   &“
  E   \€€ Z   Ŕ€E@  F€Ŕ Z@  Ŕ€EŔ  F Á X@Á Ŕ €E@  F€Á Z     € € EŔ K Â \€ †@Â Ä   WŔ @ €Ĺ€ Ü@€ ĹŔ ËŔÂÜ€ Ă A €C€‹Ă Â ś€Á Â BD‚ A „€ š  Ŕ€„€ †BAšB  Ŕ €„€ Ć‚D‰Â‚‚€€„€ †BAĆ‚DŔ@€…Â śB€ „€ Ć‚D‰Â‚‚Ŕ€„€ †EšB  Ŕ€‹BĹ ś‚ š  Ŕ €…Â śB€ „€ ‰‚EŠ„ ĆÂĹ †Â†Fš  @€„ ĆÂĹ †Â†F†‚D€€€„€š   €„€†EÄ ĂĹ ĆĆĆĆ‚ÄŔ€€Š ĹB Ć‚Ć FĂĹ CFÜ‚  FĂĹ CFD˘B €…Â śB€ … Â€ śB š   €…B †‚FŔ ś‚ ÎAG„ šB  @€…Â ‹‚G
  EĂ 	C„FČ 	Cś‚€†BA „€š  €€„€” ĹB Ü‚€ ĚÂ‚†Ŕ@€…Â ‹‚G
  EĂ FÉ	C‘FČ 	Cś‚€€…Â ‹‚G
 EC	 	C„FČ 	C	E“	Ĺ“ś‚€†BAĹ
  Ü €D  DJ„J €	€D  DJ„J@A@€ÄĘ  Ŕ€  E „€\@€…E Ŕ€
†Ëś…€ŔKŔ €†…É
š    €€ a„  ŔüD  Ŕ€D †ĚF„„IDĚ•€€„Ě  Ŕ € FĚD	DL™ÄÉ  @€D  DJFÄĚ
D šŔ € FĚD	DĚ“á‚   ńĘ  
  J  Š  ĹC
 Ü€ Ú  @M€ĹĂ ËÇJ„  I„E“…Ä †„M	I„Ü€Ŕ€ĹĂ ËÇJÄ  …D	 I„„„I„E“I„Ĺ“Ü€@€ĹĂ ËÇJ …Ä
 I„„„I„E“I„Ĺ“‹Î ś„ I„Ü€Ä „GŠÄ  ĹD ‰Ä„„‰„E“‰„Ĺ“„€€ Ä „GŠ Ĺ„ ‰Ä„„‰„E“‰„Ĺ“ËÎ Ü„ ‰Ä„€EÄ K„ÇĘ Ĺ É…„É„E“É„Ĺ“Î … É\„€…Ä ‹„G	
 E 	E…„	…E“	…Ĺ“KÎ \… 	Eś„€ĹÄ Ë„Ç	J …E I……„I…E“I…Ĺ“‹Î ś… I…Ü„€Ĺ …G
Š Ĺ… ‰Ĺ…„‰…E“‰…Ĺ“ËÎ Ü… ‰Ĺ…€EĹ K…Ç
Ę Ć É†„É…E“É…Ĺ“Î † É\…€…Ĺ ‹…G
 E 	F†„	†E“	†Ĺ“KÎ \† 	Fś…€ĹĹ Ë…ÇJ …F I††„I†E“I†Ĺ“‹Î ś† I†Ü…€ @€@€K‡P\‡ ZG  @€FH†Č W€‡@€KÇP\‡ ZG  @€FQZ  € €T LGÁ	‡!†  Ŕú @€@€K‡P\‡ ZG  @€KÇP\‡ ZG  @€FQZ  € €T LGÁ	‡!†  Ŕű @ €€K‡P\‡ ZG  €€FH†Č W€‡€€KÇP\‡ ZG  € €T LGÁ	‡!†  €ű @ €€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €ü @€€€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €ü @ 	€€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €ü @€	€€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €ü @ 
€€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €ü @€
€€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €ü @€€€K‡P\‡ ZG  €€KÇP\‡ ZG  € €T LGÁ	‡!†  €üÄ€Ú  Ŕ €Ä€Ô€@ŃŔ€ĹĂ ËÇJÄ  …Ä †I	I„‘‹Î ś„ I„IDLŁÜ€Č€Ĺ
 €Ü€±€ĹÉ	E  @€…É	  €€ĹŃ	… E  €€E @€ €€	…€ R
  €LBÁ…Đ	… E  @¬€ĹĐ	… E  @«€ĹÉ	  €Ş€…É	  Ŕ©€ĹŃ	… E  Ŕ¨€Z  Ŕ€EŇF…ŇME…‚OE…‚E
FEŇ	†…Ň	Ť……‚Ź……‚N……
 …
  €@€	Ĺ A …   @	€E @€ € …€  Ŕ€E @€ €€	…€F…SLĹÓ
@
Ŕ€Ô	€€ĹE  € …€FEŇ	 …
Ŕ€K…Ô Ŕ  €	\E EĹ …E  †UŚ……ŞĆĹĹ † Ő†\E€EĹ E Á \E€Ĺ AĹ …    €Ö	… E   € FĹĹ E
EV
D W@
@
€…Ö	  €€EÂ	EĹ W@
€€…Ă  …€EE €€ Ŕ 
\…€Z  @	€EE €€ Ŕ€	†× €€	€\…  Z   €EE €€ Ŕ€	\…€†…S
ŚĹW€…
 €K…Ô Ŕ 
 €	\E EĹ ‹…×  €	ś…€ŽXĆĹĹ † Ő†\E€EĹ ‹…×  €	ś…€ŽXŚĹKÁĹ \E€Ö	… E  @3€…Ö	  €2€E @€	E Â€ …   Ŕ0€EĹ †ĹE
Á… •Ĺ\… Z   /€D †ĹE
F……
F…Ř
Z  €-€„ ĆĹE
†Ĺ†…X‹ĹXś… ŽXĹE  ĆŐŚĹË…W
@€	Ü…€ÎŘŚĹÄ ĆE
Ć†Ć…ŘËŮAF „ ĆĆE
†Ć
††X
††D
Ü… † ĆY@ 
€€	Ŕ  €†€D †ĆE
F††F†ŘKŮÁ  FÇE
G‡X‡D\† …F ś†€ šF   !€…F Ŕ 
 FÇE
G‡Xś†€š  Ŕ€…F  †FJ
Ä€Ć†„
€†
@€  Ŕ€…F Ŕ 
  ś†€Ä ÇE
Ć‡
Ć†Ř
Ć†Ó
ÍF†
Ŕ
Ŕ€…F Ŕ 
 €	OX…G Ŕ 
  ś‡€ŹÇL‡‡L‡Úś† š  @€„ ĆĆE
†Ć
†FV
Ä WŔ
Ŕ€„ ĆĆE
†Ć
†FV
Ä€WŔ
 €„ ĆĆE
†Ć
†FV
Ä WŔ
@€„ ĆĆE
†Ć
†FV
Ä Ŕ
€€†ĆZ
šF  Ŕ €‹Ű	ś† š  €
€…F Ŕ€	  
ś†€ÎĹŔ
  €†Ë	…F Ŕ 
  ś†€Ä ÇE
Ć‡
Ć†Ř
Ć†Ó
ĚĆ×
Ŕ
€€‹†T
 FÇE
G‡X@ śF „€ĹF  ĆFĘ
XĚ‡
G  UXÍ‡
G @ 
€ ‡€ÇĚ‡
‰Ć	…Ć Ä ÇE
Ć‡
Ć†Ř
ËĆŘ
Ü† ÎŘ
ÇE
A‡ GśF€E @€	†…Ű	Ć…Ö	Ú  €R€   R€Ć…IÚ  @Q€Ä ĆEĆ†ĆEÖ€W †€O€ĆĹŰĆEÁĆĹĹĆE †Ŕ€Ä ĆEĆ†ĆEÖ  † €Ĺ F Ü… ÚE  Ŕ€ĆER† @ ‚  †€ † €  ŔH€Ä ĆEĆ†ĆEÖ W †Ŕ€Ä ĆEĆ†ĆEÖ W † €Ä ĆEĆ†ĆEÖ€W †@€Ä ĆEĆ†ĆEÖ W †€€Ä ĆEĆ†ĆEÖ€ † @€ĆĹZÚE  €€ĹE   @€	Ü…€†Ű	 †€=€ĹĹ  ÜE Ä ĆEĆ†€É†¬ĹĹ F Ü… Ú  @€ĹE  Ë…ÝEĆ FŢ††Ë	ÜE ĹĹ F AF ÜE€ĹĹ † FĆEĆ U††ÜE€ 6€Ĺ…  €	B  Ü…€FŇ	YŔ@€Ëß	Ü… Ú  Ŕ€Ëß	Ü… ĆEßW€ß €Ëß	Ü… ĆEßŔß@€  @0€ĆĹZÚ  €/€ĹE   @€	Ü…€†Ű	 †Ŕ-€Ä ĆEĆ†ĆEÖ W †Ŕ€Ä ĆEĆ†ĆEÖ W † €Ä ĆEĆ†ĆEÖ€W †@€Ä ĆEĆ†ĆEÖ W †€€Ä ĆEĆ†ĆEÖ€ † %€ĹĹ   ÜE Ĺ  Ü@€ FÇĹ
GD †ÇEF‡‡FGÖ„ W€‡Ŕ€F‡IZ   €FGR@‡Ŕ@€D †ÇEF‡‡IÇÁD †ÇEF‡‡„ I‡‡¬Ŕ €D †ÇEF‡‡IÇ`Áá…  Ŕ÷ĹĹ ! Ü… Ú   €ĹE  Ë…ÝEĆ FFá††Ë	ÜE ĹĹ F A! ÜE€@€ĆĹŰĆEÁĆĹĹĆE †Ŕ€Ä ĆEĆ†ĆEÖ  † €Ĺ F Ü… ÚE  Ŕ€  @€Ä ĆEĆ†ĆEÖ W †Ŕ€Ä ĆEĆ†ĆEÖ W † €Ä ĆEĆ†ĆEÖ€W †@€Ä ĆEĆ†ĆEÖ W †€€Ä ĆEĆ†ĆEÖ€ †€	€ĆĹZÚ  Ŕ€ĹE   @€	Ü…€†Ű	 † €ĹĹ  ÜE Ä ĆEĆ†€É†¬ĹĹ F Ü… Ú  @€ĹE  Ë…ÝEĆ FŢ††Ë	ÜE ĹĹ F AF ÜE€ĹĹ † FĆEĆ U††ÜE€á  €M  Ŕ€ĆVÚ   €ĆIÚ  @€ĆHÎ „  „  €@ Ĺ  Ü@‚…É	E  Ŕ€ …
D 	E…¬ …
	Ĺ`Á …
	ELĂ …
	ĹŕĂ …
	DÄ FĹĹ	E
EV
D€@
€€Ĺ @ 	… U……
…   Ŕ€ FĹĹ	E
Eb
   € FĹĹ	E
D †ĹĹ	F……
FEâ
	E…¬ FĹĹ	E
	ĹŕÄ € FĹĹ	E
D 	E…¬…â	Ĺ" …€  €€ FĹĹ	E
EV
D W@
€€ FĹĹ	E
EV
D€@
 € FĹĹ	E
D€	E…¬ FĹĹ	E
EV
D€@
€€…Ă	… …€K…Ă	ÁĹ \…€ ËĂ	A Ü…€ †	Ć`Á ††a  € € †	FLĂĆ FĆĹ	† U†††   @€†Ä €€F @€	€€†€   €# @€	†   Ŕ€K†Ô	Ŕ€‡K\F EĆ ‹ĆŘś† ŽX
ĆĆĹ	‡ Ő‡
\F€  @ €€ 
  €€€
š   €F @€	€ †€  €€†Ô	€ Ä Ć†Ë
F Ć A †ĆĹ	Á† •Ć
F€Ć FĆĹ	F# U†††   @€†ă	„ ††K
F€Ć AĆ# †ĆĹ	ÁF# •Ć
F€ …
EV
D W@
Ŕ€…É	  Ŕ(€EŇ	Fä	…E Ŕ€	 ś…€ĆEä	ŹĹN……
E
F…ä	OĹä
@
@	€ …
EV
D€W@
Ŕ€ …
EV
D W@
@€ …
EV
D€W@
Ŕ€ …
EV
D @
€€ …
Ĺa
   €E D F…„
FĹá
F…Ë
€€	…€X ° €…â	% …€  €€Ĺ @ 	E% U……
…   Ŕ€ …
EV
D W@
€€ …
D 	E…¬ …
	Ĺ`Á …
…a
  € € …
	ELĂ…% @€	E  €€ĹĹ%  €	Ü… ÚE  @€Ä Ć…„ĆĹáÚ   €ĹE  €	D F†„FĆáF†ËÜ…€Ŕ°Ŕ€Ë…â A& Ü…€ÚE  €€š  @€Ć…ä FŇ Í†Ŕ…Ŕ €Ë…Ô FFÁ
€€ ÜE Ŕ€ĹE  € @€	Ü…€Ŕ…ŞŔ €ËEć	@€ ÜE€@€Ë…Ô FFÁ
€€	ÜE  €Ĺ…&  €	@ 	„ ††K
ÜE ĹĹ   	A† FÜ… Ú  Ŕ €Ë…ă	D F†ËÜE€ĹĹ Ć @ 	F% U††ÜE€…É	   € …
EV
D @
 €EŇ	F…ä	OEÇ
X …
@€ …
EV
D€@
Ŕ€Ĺ% @€	… E  €€Ĺ @ 	Ĺ U……
…   Ŕ € …
D 	E…¬ EE …   Ŕ €E  Ĺf
  €€ …
EV
D @
@R€ EE …   Ŕ €E  Ĺf
   P€…É	  €R€ç	… E  €Q€Eç	… E  €P€ …
EV
D W@
 O€ …
EV
D€W@
€M€ …
EV
D€W@
 L€E @€…' Ŕ€	Z  €€Ć…ÉÚ  Ŕ€ĹE  €	@€Ü…€Ćç	ĆKŔ€€Ă€ D€€€KÇQ\‡ ZG  €€F‡IZ  Ŕ€FÇIZ   €Ú  @€EG €€	Ŕ€\‡€…G Ŕ€	  ś‡€@  €Ŕ !†  €ů@€Z   €ĆĹÉÚE  @€Ä ĆĹ	Ć†Ćâ Ä€€Ä ĆĹ	Ć†F  FJÉÄ €ĹE  ĆEĘ FĆĹ	FbÍ†Ŕ…˘Ŕ€Ä ĆĹ	Ć†ÉĹ`ÁÄ ĆĹ	Ć†ÉDÄZ  €€ĆčÚ  Ŕ €Ä Ć…„ É†¬ĆĹŰ  Z  @€F†ÉZ  €€FĆÉZ  Ŕ€EF €€	Ŕ€\†€XŔËŔ€E  @€E …F \† Z  Ŕ€EF  FĆćZF  Ŕ€Z  @€F†ÉZ  €€E
 €€\€€†ÇĹĆÇĹ	ŔŔ€„ †‡†GVÄ WŔŔ €„ †‡Ä ‰Ç‡¬…G( Ŕ€	  	@€‚€ śG€„ ĆÇĹ	†Ç‰GÁ   €†ÇĹĆÇEŔ  €€ a†  €÷D F†„FFÖ„ W€†@€D F†„FFÖ„ 	W€†Ŕ€D F†„FFÖ„€W€†@€D F†„FFÖ„ €†Ŕ€Z  Ŕ€F†ÉZ   €F†ÖZ  @ €E  @€D F†„FFÖ„ €†€€D F†„FFÖ„ W€† €D F†„„ I††¬D F†„IĆŕĂD F†„IĆ`ŃD F†„IFLĂEF( €€	Ŕ 	 €B€ \F€D †ĆĹ	F††IFÁ €FĆŰFFÁZ  @€FĆĹ	†ĆŰ†FA
†ĆE
€† €E …F \† ZF  Ŕ€D F†„„ I††¬D F†„IĆ`Á@€EĆ € 	ÁF# •Ć
\† Z  €
€D F†„FFÖ„ W€†@€D F†„FFÖ„€W€†Ŕ €D F†„„ I††¬D F†„IĆ`ÁK†ă	ĹF  ĆĆč
\F€EĆ Ć Ŕ 	G# Ő‡
\F€ € …
EV
D @
€€ …
D 	E…¬ …
	Ĺ`Á …
EV
D€W@
@€ …
EV
D @
Ŕ€Ĺ @ 	) U……
…    €Ĺ Ei
ŠE  ‰ĹÓ…€E
 € 
\@€†Ćéš  €€ĆFB
G  ‡
€€š   €Ëę	@ ÜF€ĹĆ G* @ 	) U‡‡ÜF€a…  Ŕú…É	  @Y€ …
EV
D€@
ŔW€  C€
Š  Ĺ   Ü@€GË	€€
‡€€^ €GË	€€
‡€@j€ € GA‰ĹZ  @€GŇ
FGŇ
@€€G @€
€€
‡€€g  €@€
á…  ŔřÄ Ć…„ĆĹáÚ  Ŕ€ĹE  ĆEĘĐ…ĘŔ €ĹE  ĆEĘĐ…ĘX@Á@€Ä  †ĆaLĆ†ĆĹĘÚE   €Ä  †ĆaLĆ†ĆĹÉÚ  €€ĹĹ †* ÜE Ä Ć…„Ć* D F†„† É†Ă€
€Ä Ć…„ĆĹáÚ  @	€ĹĹ   	A+ FÜ… Ú  €€ĹĹ F+ ÜE ĹĹ*  †Ü… Ú  Ŕ€F @€	††Ë†€EF €€	Ä Ć†„
ĆĆá
Ć†Ë
\†€@€ € †	Ć…ĂĆ A € 	Á+ •Ć
F€Ă€ †Ća  @€ D F†„FĆáFĚĆE  Z  @	€E
 € \€€†ČĆČ Ŕ€€…G Ŕ€ €
ś‡€€k  €€ a†  €üE „€\€€†‡Éš  Ŕ€†ÇÉš   €…G Ŕ€ €
ś‡€€g€ €E    €€ a†  €űF   €E  @ €X@‚‚ €Z  €€Ú   €FĆĘZF  @€FĆÉZF  €€F†ĚZF  Ŕ€EF ††ËŔ€	\†€…F Ŕ€
 €	ś†€€†@€EF €€
Ŕ€	\†€ŔËŔ €D F†„„ I††¬Z  @ €@€
Ŕ €C€D F†„IĆ`ÁB  Z  €€††Éš  Ŕ€‹Ű	ś† šF  Ŕ€…Ć ÁĆ+ śF …†& Ŕ€	  	F‡Ëś† @ 
…F Ŕ€ €	ś†€ŔK
 €†FÂĹF Ŕ
@€‚  Ĺ
  €Ü@€ČFČ @@€Ń  €€H @€€€€EH €€	Ŕ€\€@  €‚€ á†  Ŕúš  €€Ĺ, ĆFě
Ô„€†GAĹG  €	€Ü†  G( @€	€ 	Ŕ€HŇX 
Ŕ € X ‚  €H  € G€€€ĹF  €	@€Ü†€Çç ‡
Ŕ
€Ë†ă	D F‡ËÜF€€	€…, †Fl
ËÔD€FGÁ…G Ŕ€	Ü€ś†  ĹF(  €	@ 	€€ĆGŇXŔ
Ŕ €Ô XŔ‡‚  €ÂG  Â€ ÜF€Ŕ€…Ć Ŕ 	G# Ő‡
ś† š   €‹†ă	‡ËśF€…Ć ÁĆ   	AG# GśF€…É	  €Ă€ …
EV
D @
 Â€
€B   Ă€"E€E € \€€‹FË	 €ś†€€^
@€‚  Ĺ €Ü €É  @€ČÉ  €€H @€€€€€g  €‚€ á†   üšF  Ŕ€Ę€€ KGË	Ŕ€\‡€€€âF€ €
a…  €öEĹ …, \E D F…„
FĹá
Z  Ŕ€EE  FEĘ
P…Ę
@ €EE  FEĘ
P…Ę
X@Á
@€D „ †…†Ĺa†LF……
FĹĘ
ZE   €D „ †…†Ĺa†LF……
FĹÉ
Z  €€EĹ …* \E D F…„
…Ĺ* Ä Ć…„ś… I……Ă€
€D F…„
FĹá
Z  @	€EĹ € 	Á+ •Ĺ\… Z  €€EĹ E+ \E EĹ* „ †…\… Z  Ŕ€…E Ŕ€	†Ë
ś…€ĹE  €	D F†„FĆáF†ËÜ…€Ŕ€ €„ †…‰E…Ă…Ĺ Á   	A+ FśE€C€
„ †…†Ĺaš  @€„ Ä Ć…„ĆĹáĆĚFĹ Ę  Z  Ŕ€ @€Ŕ€FQZ   €KGË	Ŕ \‡€€çŔ€KGKĆ‡Ë
\‡€YŔě €FÇIZ  Ŕ€EG € Ć‡Ë
\‡€ í@€T€LGÁÉ‡š  Ŕ €FGR†GR€‡  €€ !†  @÷ĆÚ	  Ŕ	€ FĚ
FĆIF  @€š  Ŕ€ FĚ
F	†Ĺ“ FĚ
FEF  FFĘ	F†™ †	FŃ †	ĆŕĂ †	Ć`Á ††a  € € †	FLĂĆ* D F†„† @   FFm
Z   €E
 € \€€†ČĆČ Ŕ€€…G Ŕ€Hm
ś‡€€k  €€ a†  €üZ  Ŕ€X Ĺ@ €  Ŕ€FFA
Z   €FE
…F Ć†Ë
 €	ś†€€†@€EF ††Ë
Ŕ€	\†€@ŰŔ €D F†„„€I††¬Z   _€Ű	† F   ^€Ć AĆ+ F †& @€	€ 	Ć†Ë
† š  @ €@ Ŕ €C€D F†„IĆ`ÁEĆ € 	ÁĆ- •Ć
\† Z  @€EF €€	Ć†Ë
\†€X@Ü €D F†„F†áZF  €€EĆ € 	ÁF# •Ć
\† Z  Ŕ€KŰ	\† ZF  Ŕ€F  @€Z  € €F†ÉZF   €D F†„F†áZ  € €D F†„IFLĂD †Ě
F††F†ĚZF  @€D †Ě
F††FĆĘZ  Ŕ€EF €€	Ć†Ë
\†€@î@€EF €€	Ć†Ë
\†€ ŘŔ €K†ă	Ć†î
\F€€€EĆ Ć. \F E/ €€	\† ‹FďśF …†/ Ŕ€śF € €K†ă	Ć†Ë
\F€EĆ Ć# Ŕ 	G# Ő‡
\F€Z   5€F†ÉZ  @4€FFŇ	…, †Ćo
Ĺ, Ćđ
, GlKÔ	ĆGđđĚČ0 @€\€‡  T€GA1 Ü†€G1 ś†€€† €FFŇ	†FŇ€†@€E, FFě‹Ô	‡ńF‡đGEÇ0 €€ś€\†  …, †Fl
ËÔF‡ń	†‡đ	L‡‡…Ç0 Ŕ€	Ü€ś†  Y@
€ €T€@†‚Ŕ €D F†„„ I††¬D F†„I†EĂD †Ě
F††IFĚ•E, FĆď…F Ŕ€‡î
ś†€ŚFU
Ĺ, ĆĆď
GäFGä Ü†€ŹĆ
ÁĆ1 \†€”€@m
 €…, †Ćo
ĹF  €F‡î
Ü†€Ěń
, ÇoFGä†Gä ‡€Ď‡
Ç1 ś†€@ 
@€”€ E
€€…, †Ćo
ĹF  €F‡î
Ü†€, ÇoFGä†Gä ‡€Ď‡
Ç1 ś†€@ 
…Ć Ŕ 	2 Ő‡
ś† š  €€…F  †FJ
†J
ÍF•€†
 
€…F  †FJ
†J
@r
Ŕ€…F Ŕ€ €	ś†€X€r
@€„ ĆĚ
†Ć
††L
š  Ŕ€‹†ă	‡î
śF€…Ć ÁĆ   	A2 GśF€…Ć ĹF  ĆFĘ
Đ†Ę
ÍĆ•ÎŘ
  	AÇ- GśF€„ ĆĚ
†Ć
‰†E™€3€…Ć Ŕ 	Ç- Ő‡
ś† š  Ŕ1€„ ĆĚ
†Ć
††L
šF  @0€…, †Fl
ËÔD€FGÁ…G Ŕ€	Ü€ś†  ĹF(  €	@ 	€€ĆGŇXŔ
Ŕ€Ô€XŔ‡‚ €ĆGŇHŇ	XŔ  €ÂG  Â€ ÜF€€)€D F†„F†áZ  @€EF €€	Ć†Ë
\†€XŔň@€EF €€	Ć†Ë
\†€@Ő@%€EĆ 3 \† Z   $€FFŇ	††ä	ŹĆd
€†Ŕ €D F†„„ I††¬D F†„IFŃD †Ě
F††I†Ĺ•D F†„IĆŕĂD F†„IĆ`ÁD F†„F†áZ  @€D F†„IFLĂ@€Ć @ 	F# U†††   €€Ű	† F  €€F3 F  Ŕ€ @ €€KGË	Ŕ \‡€€Ţ@€B  … Ä€ś €ĆIÚ  @€ĆČIÚ  €€ĹH  	 @	 Ü€€ç  €B€ ˇ‡   üZG  Ŕ €„ †‡Ä€‰Ç‡¬!†  €÷ †	ĆŕĂ †	Ć`Á ††a  € € †	FLĂ ††h  @€F @€	„ ††
††h
††n
†€ â€€†ă	„ ††
††h
††n
F€Ć AĆ# € 	ÁF# •Ć
F€@€Ć* D F†„‚€ †€  €€EF €€	Ć†n\†€@â €K†ă	Ć†n\F€EĆ Ć# Ŕ 	G# Ő‡
\F€…É	  @6€EÖ	D W@
Ŕ €EÖ	D€@
€€…ó	EĹ3 Fô
@
 € …
D€	E…¬ €…ó	EĹ3 FEô
@
Ŕ € …
D 	E…¬Ĺ A3 …   @.€Z  @€ĹÉ  €€E @€ €€…€ …— €E @€ €€…€@n
€€ FĹĹ E
EV
D W@
 € FĹĹ E
Ĺa
  Ŕ&€E @€ „ ĆĹĹ †Ĺ†Ĺa†…K…€ …Ş@$€E @€ „ ĆĹĹ †Ĺ†Ĺa†…K…€ m
Ŕ!€ FĹĹ E
EV
D @
  € FĹĹ E
s
E  €€ FĹĹ E
K…Ă Á…4 \…€	Eć FĹĹ E
s
C€
Z  Ŕ€†ĹÉš   €…E Ŕ€  €ś…€€…—€€…E Ŕ€  €ś…€@n €„ ĆĹĹ †Ĺ†EVÄ Ŕ@ €F…Ë €„ ĆĹĹ †Ĺ†ĹaF…KZ  @€…E Ŕ€  €
ś…€€…é@€†…Ë Ť……
ŽĹtĹE  €
@€ Ü…€ŹĹĆ…Ë LĹ„ ĆĹĹ †Ĺ‰Eę…E Ŕ€   
ś…€š  Ŕ€…Ĺ Á3 śE ‹…Ô   
@€
śE Z  @€…Ĺ Ë…× @€Ü…€ÎŘĆĹ A† FśE€…Ĺ Ë…× @€Ü…€ÎŘĚĹË3 śE€ €…Ĺ Ë…× D †ĆĹ F††FĆáF†ËÜ…€ÎŘĆĹ A† FśE€…Ĺ Ë…× D †ĆĹ F††FĆáF†ËÜ…€ÎŘĚĹË3 śE€á  Ŕá} € Ő      PlayingGame    client    paused    Animations 	   maxCount       đ?	   shopOpen    entityList 
   GetMyHero    classId    Close    GetMyPlayer    GetAbility       @	   FindItem    item_ethereal_blade         
   GetMouseover    level    collectMeepos        @
   AghanimState    handle    poof    AbilityDamage 
   GetDamage    drawStates 
   SwitchTreads ffffffö?   GetEntities    CDOTA_Unit_Fountain    team    getAliveNumber    type 
   LuaEntity 
   TYPE_HERO    CDOTA_BaseNPC_Creep_Lane    alive    visible    ipairs 	   gameTime       N@   farmed    pairs    GetDistance2D 	   position      @@   id  	   stacking    visTime       >@   anyMeepoIsFarming 
   TEAM_NEUTRAL    CDOTA_BaseNPC_Creep_Siege 
   GetEnemyTeam    CDOTA_BaseNPC_Tower $   CDOTA_BaseNPC_Venomancer_PlagueWard    CDOTA_Unit_VisageFamiliar    CDOTA_Unit_SpiritBear "   CDOTA_Unit_Broodmother_Spiderling !   CDOTA_Unit_Hero_Beastmaster_Boar $   CDOTA_BaseNPC_Invoker_Forged_Spirit    CDOTA_BaseNPC_Building    CDOTA_BaseNPC_Barracks    IsInvul    IsAttackImmune    spawned       @	   illusion    IsIllusion      p§@   health 
   dmgResist    SleepCheck 	   ethereal    canCast 
   castRange       I@   DamageTaken    DAMAGE_MAGC    CastAbility    Sleep    latency       i@	   -casting    hex    IsMagicImmune    state    hero    CDOTA_BaseNPC_Creep_Neutral    item_sheepstick    chainEarthbind    GetTurnTime       9@     @Ź@   getClosest 
   earthbind    FindCastPoint    GetSpecialData    speed 
   SkillShot 
   SkillShotXYZ    radius    earthbindAnimation 333333Ó?   visibleToEnemy 
   IsChanneling    anyMeepoisNear 
   dayVision 
   selection 
   IsKeyDown    mainkey    IncomingDamage    DebugPrint    EscapeE    ping    Ping    Client    PING_DANGER      X»@     @Ż@   -escape    GetChanneledAbility    name    item_travel_boots    item_tpscroll    EscapeC      Ŕr@   victim     pingdanger    PING_NORMAL    foundCreep    camp    victimFogTime 
   lastState    DoesHaveModifier 2   modifier_spirit_breaker_charge_of_darkness_vision    getFarrestMeepo    -move    Move      p‡@   healthRegen 
   movespeed 
   maxHealth       @   modifier_bloodseeker_thirst    -heal    haveHealingItems    IsInDanger    modifier_flask_healing    Follow    useTP    chat 
   IsStunned 	   IsRooted      ŕ…@   attackRange    neutral    OrbWalk 	   lastcamp    mousePosition    unaggro    GetProjectiles    target    source    Attack       y@
   Getting Camp    getClosestCamp    -camp    Getting Camp 2      @ź@   FarmJungle2    math    ceil    FarmJungle1       ‰@     Ŕ’@      @     ł@   stack      ŕu@     p—@   stackPosition    HoldPos    SelectUnit 
   HoldPosition    SelectBack    min    max    dmgMin 	   dmgBonus    DAMAGE_PHYS       Y@     Ŕb@   dmgMax        @   -moveStack      €L@     @o@     Ŕ‚@   blink    tp 	   activity 
   LuaEntityNPC    ACTIVITY_MOVE    ACTIVITY_IDLE    item_blink      0‘@	   blinkPos                     Ź  ·  
       €€    @_€@  €@ €    Ŕ €FŔ@ …  W€€ Ŕ €E@ K€Á \@  \€B € H   B   H € FŔ@ H  B € H €J   H  J   H €EŔ ‚ € \@ C € H  C € H €C € H  J €  Á   A  Á  b@€H €J    Á  b@ H  J   H €J  Š€ Ĺ€ Á A A Ü€ ‰Ŕ€„Ĺ€ Á A A Ü€ ‰Ŕ ‡Ĺ€ Á A A Ü€ ‰Ŕ ‰‰€ĹŠ‰ Ć‹‰€ĆŚ‰ ÇŤ‰€ĆŽ‰ BŹ‰€ĆŹĘ€  A A ÁA  É „ A Á ÁA  É ‡ A	 A	 Á	  É ‰É€ĹŠÉ€Ĺ‹É€ĆŚÉŔÉŤÉ€ĆŽÉ BŹÉ€ĆŹ
 E 
 ÁA
 ‚	 \ 	A„E 
 ÁÁ
 ‚	 \ 	A‡E  ÁA ‚	 \ 	A‰	ĹŠ	ÁÉ‹	ĆŚ	ÇŤ	ĆŽ	BŹ	ĆŹJ … Á Â A‚	 ś I„… Á B A‚	 ś I‡… Á Â A‚	 ś I‰IĹŠIÍ‹IĆŚIÁÉŤIĆŽIBŹIĆŹŠ Ĺ B
 A‚
 ‚	 Ü ‰Á„Ĺ Â
 A ‚	 Ü ‰Á‡Ĺ B A‚ ‚	 Ü ‰Á‰‰ĹŠ‰ÁÎ‹‰ĆŚ‰ĆŤ‰ĆŽ‰BŹ‰ĆŹĘÁ ‚ A B Á‚	 ‚ É‚„‚ A‚ Â Á ‚ É‡‚ AB ‚ Á‚	 ‚ É‰ÉĹŠÉÁĐ‹ÉĆŚÉŃŤÉĆŽÉBŹÉŃ˘ÉĆŹ
‚ E‚ Â Á 	 \‚ 	B‚„E‚ B Á‚ 	 \‚ 	B‡E‚ Â Á 	 \‚ 	B‰	ÂÉŠ	BÓ‹	‚ĆŚ	ÇŤ	‚ĆŽ	BŹ	‚ĆŹJ‚ …‚ Á‚ Ă A	 ś‚ I‚‚„…‚ Á C A	 ś‚ I‚‡…‚ Á‚ Ă A	 ś‚ I‚‰IÂÉŠIÇ‹I‚ĆŚIÂÉŤI‚ĆŽIBŹI‚ĆŹŠ‚ Ĺ‚  AC C Ü‚ ‰Â‚„Ĺ‚  AĂ  Ü‚ ‰Â‡Ĺ‚ C A C Ü‚ ‰Â‰‰ÂÉŠ‰ÂÖ‹‰‚ĆŚ‰ÂÉŤ‰‚ĆŽ‰BŹ‰‚ĆŹĘ‚  A C Á	  É„ A Ă Á	  É‡ A C Á	  É‰ÉÂÉŠÉ‚Ř‹É‚ĆŚÉĆŤÉ‚ĆŽÉBŹÉ‚ĆŹ
 E Ă Á „	 \ 	C„E C Á Ä \ 	C‡E  ÁC „	 \ 	C‰	ĂÉŠ	Ú‹	ĆŚ	ÇŤ	ĆŽ	BŹ	ĆŹJĂ … ÁĂ  AD ś I„… ÁC „ AD ś I‡… ÁĂ  AD ś I‰IĂÉŠIŃ‹IĆŚIŃŤIĆŽIBŹIŃ˘IĆŹb@ H  E@ K@Ü Ĺ€ Á \@ E@ K@Ü Ĺ  A \@ E@ K€Ý ĹŔ \@€ € x      PlayingGame    entityList 
   GetMyHero    classId    CDOTA_Unit_Hero_Meepo    script    Disable    collectMeepos         	   position    Vector      ¬‘Ŕ     ŻŔ     Ŕ_@   stackPosition {®GárźŔ{®Ga–®Ŕ      `@
   waitPosition      Ś¤Ŕq=
×ă°Ŕ   team        @   id       đ?   farmed     lvlReq        @   visible    visTime 	   stacking      ŕvŔ     §ŔnŔ±€Ŕ®Gáz
śŔ     Ŕ€@     r§Ŕ      p@      @ÍĚĚĚĚ™@…ëQ¸ŇŞŔö(\ŹÂ´”@…ëQ8ôłŔ®Gáz@{®Ga©°Ŕ     l¨@     ŢŞŔ
×Łp}:±@     "ŻŔ     “Ş@q=
×c‰°Ŕ      @Ăő(\®§@Ăő(\€±Ŕ¸…ëQň—@q=
×ă“´Ŕ…ëQ8÷¦@ěQ¸…QµŔ      @     ^§Ŕ     ŕg@     6«Ŕ     ›Ŕ     ŕn@     ŁŔ     @vŔ      @      (@	   ancients      <’@     ľ©@{®GáÖ@)\ŹÂőŁ±@     Ź@     ¬@      @     €nŔ     Z¬@®GázI’Ŕ¤p=
—ĺ±@     €Ŕ     í˛@     ĐŔ     Ą@     X”Ŕ¸…ëŃŇ¬@ţÔxé&
a@     L—Ŕ     T§@      "@®Gáz«¨Ŕ)\ŹÂu{±@33333Ŕ©Ŕ®Gáz„µ@     ¨Ŕ     <ł@      $@     ±Ŕ     8¬@®GázĄ§Ŕ{®Ga×­@×Łp=
‹`@     6ŻŔ      Ż@      &@     tŻ@•C‹/†ŔR¸…ëhˇ@…ëQ¸[Ŕ     d¨@ö(\ŹÂ’Ŕ   RegisterEvent    EVENT_FRAME    Main 
   EVENT_KEY    Key    UnregisterEvent    Load                     »  Ý  
  q            €  €   
    €
         €         €
 €A      Á     A    Á  "@€  
  A      "@  €
     
  J€ …€  ÁŔ   AA ś€ I€€€…€  ÁŔ  AA ś€ I€ …€  ÁŔ  AA ś€ I€ …I€Ă†I Ä‡I€ÄI Ĺ‰I€ÄŠI @‹I€Ä‹Š€ Ĺ€   AA A Ü€ ‰Ŕ€€Ĺ€   AÁ A Ü€ ‰Ŕ Ĺ€   AA  Ü€ ‰Ŕ …‰€Ă†‰€Ă‡‰€Ä‰ŔÇ‰‰€ÄŠ‰ @‹‰€Ä‹Ę€   A A Á  É €  A Á Á  É   A	 A	 Á  É …É€Ă†ÉŔÇ‡É€ÄÉ Ĺ‰É€ÄŠÉ @‹É€Ä‹
 E  	 ÁÁ	 ‚ \ 	A€E  
 ÁA
 ‚ \ 	AE  
 ÁÁ
 ‚ \ 	A…	Ă†	Ë‡	Ä	ÁÇ‰	ÄŠ	@‹	Ä‹J …  ÁA ‚ A‚ ś I€…  ÁÁ  A‚ ś I…  ÁA ‚ A‚ ś I…IĂ†IÁĚ‡IÄIÄ‰IÄŠI@‹IÄ‹ŠÁ Ĺ  
 AB
 ‚ Ü ‰Á€Ĺ  ‚
 AÂ
  Ü ‰ÁĹ  B A‚ ‚ Ü ‰Á…‰Ă†‰ÁÎ‡‰Ä‰Ď‰‰ÄŠ‰@‹‰Ďž‰Ä‹Ę ‚  AÂ  Á‚ ‚ É‚€‚  AB ‚ Á‚ ‚ É‚  AÂ  Á‚ ‚ É…ÉÁÇ†ÉAŃ‡ÉÄÉĹ‰ÉÄŠÉ@‹ÉÄ‹
‚ E‚  ‚ ÁÂ  \‚ 	B‚€E‚   ÁB  \‚ 	BE‚  ‚ ÁÂ  \‚ 	B…	ÂÇ†	Ĺ‡	‚Ä	ÂÇ‰	‚ÄŠ	@‹	‚Ä‹J‚ …‚  Á C AC ś‚ I‚‚€…‚  Á‚ Ă A ś‚ I‚…‚  ÁB  AC ś‚ I‚…IÂÇ†IÂÔ‡I‚ÄIÂÇ‰I‚ÄŠI@‹I‚Ä‹Š‚ Ĺ‚   AC  Ü‚ ‰Â‚€Ĺ‚   AĂ  Ü‚ ‰ÂĹ‚   AC  Ü‚ ‰Â…‰ÂÇ†‰‚Ö‡‰‚Ä‰Ä‰‰‚ÄŠ‰@‹‰‚Ä‹Ę‚   AĂ  Á  É€  AC  ÁĂ  É  A C Á  É…ÉÂÇ†É‚Ř‡É‚ÄÉĹ‰É‚ÄŠÉ@‹É‚Ä‹
Ă E  Ă Á D \ 	C€E  C Á D \ 	CE  Ă Á D \ 	C…	ĂÇ†	Ď‡	Ä	Ď‰	ÄŠ	@‹	Ďž	Ä‹"@  €     €€@ €Z …Ŕ @€@ €Z …  @€@ @[ …€ ĹŔ @       € p           	   position    Vector      ¬‘Ŕ     ŻŔ     Ŕ_@   stackPosition {®GárźŔ{®Ga–®Ŕ      `@
   waitPosition      Ś¤Ŕq=
×ă°Ŕ   team        @   id       đ?   farmed     lvlReq        @   visible    visTime 	   stacking      ŕvŔ     §ŔnŔ±€Ŕ®Gáz
śŔ     Ŕ€@     r§Ŕ      p@      @ÍĚĚĚĚ™@…ëQ¸ŇŞŔö(\ŹÂ´”@…ëQ8ôłŔ®Gáz@{®Ga©°Ŕ     l¨@     ŢŞŔ
×Łp}:±@     "ŻŔ     “Ş@q=
×c‰°Ŕ      @Ăő(\®§@Ăő(\€±Ŕ¸…ëQň—@q=
×ă“´Ŕ…ëQ8÷¦@ěQ¸…QµŔ      @     ^§Ŕ     ŕg@     6«Ŕ     ›Ŕ     ŕn@     ŁŔ     @vŔ      @      (@	   ancients      <’@     ľ©@{®GáÖ@)\ŹÂőŁ±@     Ź@     ¬@      @     €nŔ     Z¬@®GázI’Ŕ¤p=
—ĺ±@     €Ŕ     í˛@     ĐŔ     Ą@     X”Ŕ¸…ëŃŇ¬@ţÔxé&
a@     L—Ŕ     T§@      "@®Gáz«¨Ŕ)\ŹÂu{±@33333Ŕ©Ŕ®Gáz„µ@     ¨Ŕ     <ł@      $@     ±Ŕ     8¬@®GázĄ§Ŕ{®Ga×­@×Łp=
‹`@     6ŻŔ      Ż@      &@     tŻ@•C‹/†ŔR¸…ëhˇ@…ëQ¸[Ŕ     d¨@ö(\ŹÂ’Ŕ   script    UnregisterEvent    Main    Key    RegisterEvent    EVENT_TICK    Load                     ę  ě       ›   Ŕ€› € @€‹ Ŕ ś€ š   @ €‹@@ ś€ ž   €       CanBeCasted    CanCast                     đ  ö    S     @€ € Ŕ  š   €€ĹA     @€ Ü€‚@Y ‚€€Ű€ €Ű €€Ě@Ŕ@€ËÁŔ Ü ÚA  Ŕ
€ËÁ Ü ÚA  Ŕ€ĆAÁ ÚA   €ĆÁ Â W ‚Ŕ
€Ĺ ĆAÂ € Ü Ú  Ŕ€ĆÂ Ú   €ĹÁ ĆĂÂ BCE‚ €€ \‚ …Â †ÂCĹ  € @  Ü€ś‚  M‚‚‚ 
BDA‚ Ü€YŔÄ@€Ú   @€  Ŕ €ĆEE  ‚@€ĆAĹ ‚ ÂEW ‚  €ÂA  Â€ Ţ  €       anyMeepoisNear    GetDistance2D       9@
   IsStunned 	   IsRooted    creep    classId    CDOTA_BaseNPC_Creep_Neutral    Animations    isAttacking    hero    math    max    abs    FindAngleR    rad    FindAngleBetween š™™™™™É?        {®Gáz„?   handle 	   activity 
   LuaEntityNPC    ACTIVITY_IDLE                     ú      [   Â     J   ÁA  ‚  AÂ   ÁB  AĂ  ÁC „ AÄ  ÁD bA †Ă ĹÁ   Ü€€Ă @€ €Ú  €€FÄZD  € €FDÄ „ €€ F„Ä€€  €Â € !   üá  €úĹÁ  € Ü  BE@€ ‚   @€ÚA  Ŕ€‚Ĺ    €Â FEÂ FBĆ…‚ Ŕ€ ś‚ ĹÂ ĆÂĆ @€ €  €Ü‚  ŤÂ\‚ MBÇ‚ ‚€YŔGŔ€A  Ŕ €Č ‚   € € €@ €B  €   € !   !   modifier_shadow_demon_disruption 7   modifier_obsidian_destroyer_astral_imprisonment_prison    modifier_eul_cyclone    modifier_invoker_tornado    modifier_bane_nightmare     modifier_shadow_shaman_shackles "   modifier_crystal_maiden_frostbite %   modifier_ember_spirit_searing_chains    modifier_axe_berserkers_call 0   modifier_lone_druid_spirit_bear_entangle_effect    modifier_meepo_earthbind    modifier_naga_siren_ensnare +   modifier_storm_spirit_electric_vortex_pull    modifier_treant_overgrowth 
   modifiers    ipairs    stunDebuff    name    remainingTime    isFacingAnyMeepo    Animations    isAttacking    hero    math    max    abs    FindAngleR    rad    FindAngleBetween š™™™™™É?        {®Gáz„?
   IsStunned                       (   N   E   K@Ŕ \€ …   ‹€@
  E FAÁ	AFÁ 	Aś€€ĹŔ   Ü €€  FÂBB  @
€  FÂ	Â   @€  FÂBD€ 	B‚„ €  FÂBD 	B‚„  FÂB	ÂB…  FÂB	ÂB†  FÂB	ÂÂ†  FÂB	ÂC‡  FÂB	ÂB  FÂB	‚Ä  FÂBKĹÁB \‚€	B‚‰  FÂBKĹÁÂ \‚€	B‹á€  €đ €       entityList 
   GetMyHero    GetEntities    type 
   LuaEntity    TYPE_MEEPO    team    ipairs    handle    state 
   lastState     victim 	   lastcamp    foundCreep     camp    victimFogTime            poof    GetAbility        @
   earthbind       đ?                    ,  5    	      @@ € E€  „   \ @€‹ÁŔ ś€š   €ĆAAÚ  @ €Â€ Ţ a€  ŔüB   ^   €       entityList 
   GetMyHero    pairs    GetAbility       đ?
   abilityPhase                     9  @          D    Ŕ€FA@„€ W€@€FA@„ €Ŕ€F@Z   €EÁ  € Ć@ĆÁ\€@Á@ €B€ ^ !€  @ú      €       pairs    state    camp    GetDistance2D 	   position      @Ź@                    D  M       Ĺ   Ë@ŔÜ€ € MA …Á  ĆA ĆAÁ‚ÁEÂ FÂ€ \‚ BEB F‚Â€€ \‚ BĚ‚A ÂBF‚Á…Â †BŔ ś‚ N‚‚…B †CŔ€ ś‚ N‚‚BFA FBĂś ĹÁ  A BAF‚Á…Â †BŔ ś‚ N‚‚R€O‚Ă…B †‚BŔ€ ś‚ N‚‚BFA FÂÂ†‚ÁĹÂ ĆÂ  Ü‚ ŽÂ’ Ź‚CĹB ĆĂ € Ü‚ ŽÂL‚‚†A †BCÜ Â  FBA…B †‚BŔ ś‚ Ž‚‚‡L‚‚†ÂBĹB ĆĂ  Ü‚ ÎÂ‚‡ŚÂĆBC‚ EÂ  †BAĹB Ć‚Â €Ü‚ ÎÂ‚‡ŚÂĆÂBC C@€ ‡ĚCC\‚ …Â  ĆBÁC B@  ĚĂÂEC FĂ€ \ NCCFCĂś‚ ĹÂ  CÁEC FÂ€€\ NCCFĂÂ…C †CŔ€ś ŽL†CĂÜ‚     €       entityList 
   GetMyHero       Ŕ   Vector 	   position    x 
   movespeed    Animations    getBackswingTime    math    cos    y    sin    z        @     €V@      ^@                    Q  X   
#   E   „   \ @€†A@ š  €€…  †Á@Ĺ  ĆÁB @  ‚ E‚  F‚Á…Â Ŕ   €ś€\‚  
BÜ ÍÂB ś€€B@ €‚€ ž a€  ŔřB   ^   €       pairs    hero    math    max    abs    FindAngleR    rad    FindAngleBetween š™™™™™É?        {®Gáz„?                    \  y   x     D  €€    €@  …B  Ŕ€ś‚ W€@  €FÂ@ †Â@Ĺ   @€Ü‚€Ú   @€ @€€€€   €Ŕ  !  €ůÚ   Ŕ€   EA  € \ W€Ŕ  €Á@ FÁŔ†AA Ĺ ĆÁÁŔ €…  ĆÁ@ ĆÂBB ‚BEÂ FĂ†BC \‚ BĚ‚Â@ ‚CFBB N‚Â…Â †ÂCĆBC ś‚ N‚‚BFÂ@ FÄś   †AÁĹ ĆÁÁŔ€€…  ĆÁŔĆÂBÂEÂ FĂ†BĂ\‚ BĚ‚ÂŔ‚CFBÂ…Â †ÂCĆBĂś‚ N‚‚BFÂŔFÄś @ … Ŕ€  ś€Z   Ŕ€@ @€š   Ŕ €ĆAÄBDW ‚Ŕ €Â€   @€Ţ   A    €       pairs    GetType    Vector 	   position    GetDistance2D 	   activity 
   LuaEntityNPC    ACTIVITY_MOVE    x 
   movespeed       ř?   math    cos    rotR    y    sin    z    handle                             }      W   Ĺ   Ë@ŔÜ€ š   @	€ E  „  \ €†ÂŔš  @€‹ÁC ś‚€š   €…‚ Ŕ€ÁC €ś‚  š   €  @€…Â Ŕ€   ś‚€ĹÂ   @  Ü‚€Ŕ  € €a   ř  
€@€‚@€
  A …  Ä  śŔ€LAÁÄ  ĆB‚ĆBÂĂ@   €@€€ €ÚB    €	‚ˇ  @ü  €
  E  „  \@€„  ††BBĆÂŔÚ  Ŕ €šB  @ €	A a  Ŕü   € 
      entityList 
   GetMyHero    pairs    alive    GetAbility       đ?   canCast    GetDistance2D            victim                     ¤  ¬    
      E@  „   \ Ŕ €†Ŕš    €Ŕ@ a€  @ţ   €               pairs    alive       đ?                    °  Ĺ    N      D    €€D  FÁ€‹AŔ‚  ś€ÁÁ  š  Ŕ€A ‚‚ €‚AÂ Á ‚ ĚÁ@€ FBÂB  @€D FÂ€ZB  Ŕ€D …‚ ‹ÂB NĂ††CÁĂ Ä@Ő„€ś‚€I‚‚D FÂ€IBD@€D FÂ€Â ĆÂ@•ÂI‚‰FBÂ„ €‚Ŕ€FÂÄZ   €D FÂ€„ †Â †‚DÁ C E†ĂÄ†ĂE€•I‚‰D FÂ€†‚CI‚Ś!€  €í €       pairs    GetAbility       @      đ?   level            GetProperty #   CDOTA_Ability_Meepo_DividedWeStand    m_nWhichDividedWeStand    state    drawMgr    CreateText       ^@     €T@       @       visible    text    victim    :     client 	   Localize    name    color                     É  Ý    	1   E   K@Ŕ \€ ‚   Ć€@ Ŕ  @ €@   ‚ € ËŔŔ A Ü€€ÁŔ A €J  Ú   € €”€ŚAIÁ   @€†ÁA€„€ €”€ŚAI†Áš  Ŕ€…A Ŕ€    ś€X€B@ €š   Ŕ €‚  Ŕ€  ž ‚€ Ă€ž€ €       entityList 
   GetMyHero    handle 	   FindItem    item_flask    item_bottle       đ?   charges            GetDistance2D      @Ź@                    â  ţ   †      € €† @ š   Ŕ€†@@ €  €…Ŕ  Ĺ  Ë@ÁJA  I Ü €ś  Ŕ€š  @€ĆÁAÚ  €€ĆA €Ŕ€Z    €ĆÁAĆÂÂ W ‚ €ĹA   FÂAÜ€X€Â €ĆÁAĆÁÂB@ Ŕ@ €Â€ Ţ ˇ€  @ř…Ŕ  Ä   ś  €Ć@Ú  @€ĆCÚ  €€ĹA    @ Ü€BC ‚Ŕ€Z   Ŕ €ĆBÂ W ‚@ €Â€ Ţ ˇ€   ú…Ŕ  Ĺ  Ë€ĂJÁ  … I‡IAD€IAD†Ü €ś  Ŕ€ĹA    @ Ü€‚DÂD ‚Ŕ€Z   Ŕ €ĆBÂ W ‚@ €Â€ Ţ ˇ€  @űŠ €Á  A A Á Á B A‚ Â Á C A ˘@€ĹŔ    Ü €€ÂG €€‚€  @ €€  á€  €ýĆ H Ú   @ €Â € Ţ   € !      alive    health            ipairs    entityList    GetProjectiles    target    source    handle    GetDistance2D      @Ź@   dmgMin    visible 
   dayVision    GetEntities    classId    CDOTA_BaseNPC_Creep_Neutral    attackRange       I@   modifier_item_urn_damage    modifier_doom_bringer_doom    modifier_axe_battle_hunger #   modifier_queenofpain_shadow_strike "   modifier_phoenix_fire_spirit_burn     modifier_venomancer_poison_nova "   modifier_venomancer_venomous_gale &   modifier_silencer_curse_of_the_silent    modifier_silencer_last_word 2   modifier_spirit_breaker_charge_of_darkness_vision    modifier_bloodseeker_thirst    DoesHaveModifier    visibleToEnemy                       
   
       €   Ĺ@    Ü  €  ‚F‚@Z  Ŕ €F‚@ €  €ŚŔ@á€   ýž   €               pairs    camp       đ?                      /   Z      €€† @ š   Ŕ€  Ĺ@    Ü Ŕ€  F‚ŔBEÂ  € Ŕ  \‚€ š    €ĹÂ    @  Ü‚€€€Á CA  @ €Á‚ @€ĂA  B@ €ÁB   €Á‚ ĂBC  €€ĂA FC €€CCFCC W@€ €ĂA  ‡Ŕ€Ŕ‚@€CA  Ŕ €X@‚@ €€‚€ €ĂC  @ €Z    €š   @€ @  †CD€E €  ĆCD\€X@Ŕ€X€‚„@€ĂCC  € €ĂB    €€  á€  @ěž   €       alive    ipairs    id    getFarmingMeeposCamp         	   ancients       @   level       $@       @      đ?   visible    lvlReq    team       1@   farmed    GetDistance2D 	   position                     3  =         Ŕ€F @ Z    €C € …@  Ä   ś  €Ć@‚@ W ‚ €Z   @€ĹÁ    @  Ü€Â  @€ €  ‚€Ŕ  €@  ˇ€   ű^   €       alive    pairs    handle    GetDistance2D                     A  K   
      @€F @ Z   €€A@  …€  Ä   ś €€Ć@Ú  Ŕ€ĹÁ    @  Ü€A ‚  €L@Á ˇ€  €ü^   €       alive            ipairs    GetDistance2D 
   dayVision       đ?                    O  h   o     @€ A  U   €€š    €  @  € € €€A A €KA Á \€ Ä  ĆA€ĆÁÁ @ Â  Ŕ  Ä  ĆB€ĆBÂÚ  €€Â  Ŕ€ @ Ă Ŕ  € @€  Ú@   	€Ú  €€Ă †Ŕ€ @  €€€  @€  Ŕ€ĂC €€Ŕ C   C D  FC€FCÄ	C  C D€ 	C KĂÄ\ NĂÂ€€ ÁC  •ĂC€€    @ €€   €€€š  @€ @  € €  Ŕ€ĂC € Ŕ C  A €€ ÁC  •ĂC€€   €       SleepCheck 	   -casting    GetDistance2D      ł@	   FindItem    item_travel_boots    item_tpscroll    poof    anyMeepoisNear    victim    hero      @Ź@   level            canCast    CastAbility 
   lastState    state    Sleep    FindCastPoint      p§@                    l  Ş   :     €M€† @ š   ŔL€†@@ €  L€€  Ę   
  D  †Á@ ĆÁĆÁŔŔ  €D€ …A Ŕ€ś€F€Z@  €€Ć‚AĆÂ‚ÚB  €€ĹÂ ĆÂ  Ü‚ ÚB  @€ĹB    @ Ü‚€€Â€
€ĹB    @ Ü‚€ĂBC €€ĹB Ć‚ĂC ĂCE € \ …C †CDĹ   @  Ü€ś  M 
ĂDA  Ü‚€€Ŕ@€ĹB ĆĹCE †EĹĂ ĆĂĹ  Ü Ä F@ „ Ě„ĎĂŚ„ ÄFGĚ„ŽĂĹC   €Ü‚  ŚŔĆ‚AÉ€ÇĹB Ă HŠC  ‰€€Ü €€„H†ÄČ„€  Ŕ€F„AFDZD  Ŕ€FÄČFDZD  Ŕ€E	 FDÉ€ \„ Z  Ŕ
€…D †E	ËDE @€……	 Ŕ Ü€ś„  Ś€†„A	G	†ÄČ	G	@
€Z@  Ŕ	€FÄÉZ   	€FÄÉF„ÁFD„ZD  Ŕ€FÄÉFĘZ  Ŕ€ED FĹ‹DE ĹÉ…E
EĹ FĹĹ
†ĹÉ\… …Ĺ †FĆĹÉś… L……
OE…Ś…… †ĹFŹGL……
E
EE †ĹÉś€\„  Ś@FÄÉF„ÁÉ€Çá‚  €ěĹB CJ Ü@	€„H†ÄČ‹„J	Ĺ
 A ś „     €E	 FDÉ€ \„ Z  €€@ €†„A†„šD   €†„Á†„šD   €…D †E	ËDE @€……	 Ŕ Ü€ś„  Ś€†„A	G	†„Á	G	á‚  ŔőĹB CKÜ€€„ @ €€„€   €„ÁD   €D @ …Ä „€FĚL„Â@ €	 DI@€„   €€ED FĹ‹DE   E…	 € ś€\„  Ś@F„Á	Çá‚  €öĹB CLÜ@€	 DI@€„   Ŕ€ @€FĚZ  €€F„ÁFDZD  €€ED € ĹÄ \„€†ĚŚ„B	€„€€ED FĹ‹DE   E…	 € ś€\„  Ś@F„Á	Çá‚  Ŕöˇ  €¸š   @ €ž  @ €  ž  € 2      alive    health            team       đ?   ipairs    handle    Animations    isAttacking    GetDistance2D       i@   attackRange       I@   math    max    abs    FindAngleR    rad    FindAngleBetween š™™™™™É?   floor    DamageTaken    dmgMin    getBackswingTime    GetAttackTime       @   client    latency      @Ź@   DAMAGE_PHYS    entityList    GetProjectiles    target 
   FindSpell    name    AbilityDamage 
   GetDamage    DAMAGE_MAGC    source    dmgMax 
   modifiers    gsub 
   modifier_     
   abilities    canCast    me 
   castRange    items                     ®  Ç    I   E   K@Ŕ \€ ‹€Ŕ Á  ś€€š   Ŕ€Ĺ  A Ü€ Ú   €€Ć€Á Ú   Ŕ
€ĆŔA   €€ Â@€AÂ € A€ EÁ FĂLA†A A€ 
€€Ă€	€AÂ € A€AÂ € A€ EÁ FĂLA†A A€@€ŔĂ €AÂ € A€AÂ € A€ EÁ FĂLAA A€€€€Ă €AÂ € A€ EÁ FĂLAA A€ €       entityList 
   GetMyHero 	   FindItem    item_power_treads    SleepCheck    treads    alive    bootsState       đ?   CastAbility    Sleep    client    latency       i@               @     @ź@                    Ë  I   Ą    A@ E  KŔ\ „  †A †Á@ËA Ü Ú    € € Ă€B ‚A@  ‚ B  @€š   Ŕ€ÂA   €B‚ B   €BB‚  B  €€š   1€‚ @€ Â U‚‚‚   @/€š   Ŕ.€C   .€BC‚ B   -€ÂA  @,€Ú   Ŕ+€‚CB   +€ÂCE W@ *€ÂCEB W@ )€‚ ÂDKEĆBE E ĚĎÂĹ @  \€‚  E‚ FÂÄ‹E€ CFE €  ś€\‚  ‹ÂF FCGś‚ Ĺ‚   @ €  Ü… Ŕ Ä @  śOČ@Ŕ€ED €  Ŕ …H… ĹH
\„ ZD  Ŕ €KI\„ ZD  Ŕ€KI\„ Z  Ŕ€FDIZD   €FÄC…„	 W€„ €FÄC…Ä	 W€„ €KJ ÁD \„€Z  Ŕ€ED
 €  ËJ AE Ü€\„  ZD  €€FDG@•Ŕ€EÄ
 €  Ŕ   B  \„€Z  Ŕ€FK Z  Ŕ€ED €  ĆK Ć„Ë	\„€ŚÄKX€„Ŕ €FL „ €„ €ED
 €  Ŕ \„€Z  Ŕ€ED \D€ Ú  Ŕ€  @€ED €  Ŕ \„€X@@ €š   €K„L Ŕ  €\D EÄ ‹„Hś„ ŽM	Ŕ€ Ĺ Ő…	\D€Ŕ€EÄ
 €  Ŕ   B  \„€Z  Ŕ€K„L Ŕ    \D EÄ ‹„Hś„ ŽM	Ŕ€ Ĺ Ő…	\D€€€FL…D
 †„M	€„@ €ED \D€ ‚ @€ Â U‚‚‚   €l€‚ @€ Â
 U‚‚‚   Ŕj€š   €?€ÂA  Ŕ>€ @ †BNŔ  ‚EC €  Ŕ \€…C Ŕ   €ś€ĹC    @ Ü€„ ÄNF„K € Ŕ  B€ „   Ŕ€D @  € „€ED € Ŕ \„€X „  €D  € FDO €Ď@3€FÄOZD  Ŕ€KP\„ ZD  €1€FÄC… W€„€0€FÄC…Ä	 W€„€/€FÄC…D W€„€.€FÄC…„ W€„€-€FÄC…D W€„€,€FCZ  Ŕ+€FÄP… †DQ	W€„ €E„ € \„ ZD  @)€D  Ŕ!€€@	€E„ FÄÎ†„K Ŕ   A ‚€ \„ ZD  Ŕ€FL „€€„€€FK Z   €ED €  ĆK Ć„Ë	\„€…D Ŕ K …K
ś„€€„ €KÄQ Ŕ \D€Ŕ  '€KR Ŕ \D€ &€E„ FÄÎ†„K Ŕ€  A ‚€ \„ ZD  Ŕ€FL „€€„€€FK Z   €ED €  ĆK Ć„Ë	\„€…D Ŕ€K …K
ś„€€„ €KÄQ Ŕ€\D€Ŕ€€€KR Ŕ \D€€€€Ŕ€FL „€€„€€FK Z   €ED €  ĆK Ć„Ë	\„€…D Ŕ K …K
ś„€€„ €KÄQ Ŕ \D€Ŕ  €KR Ŕ \D€ €FL „€€„€€FK Z   €ED €  ĆK Ć„Ë	\„€…D Ŕ€K …K
ś„€€„ €KÄQ Ŕ€\D€Ŕ€ €KR Ŕ \D€ €FL „€€„€€FK Z   €ED €  ĆK Ć„Ë	\„€…D Ŕ K …K
ś„€€„ €KÄQ Ŕ \D€Ŕ  €KR Ŕ \D€ €KR Ŕ \D€ €BRBF  @€‚R FBRFBĆF‚ŇW@Ŕ€  B D€	B  B 	ÓĄ€€  B 	BSÂQ …‚ †ÂSB€Â EB FÔ€  \‚ NÍ€€ ÁÂ
 •ÂB€‚Ň ‚  !€   @ €š   Ŕ€ÂA   €B‚ B   €BB‚ B   €š  @€‚ @€ Â U‚‚‚   €€š    €C  @€BT F‚T OÂÔ ‚ €ÂF ĆBG‚ E‚ € Ŕ    \CG • 
€Ă
 @  € Ŕ € €   €C @  € €NU @	€C
 @  € €   €C C€ L € Ŕ€C   C D  FC€FĚ	CŞ  C D€	CĂ KH\ NÍ€€ ÁĂ •ĂC€€€LEC
 FÍ@@ €C C€ ‚ @  €€ Ć‚K€ B€‚ @€ Â U‚‚‚   Ŕ€‚ @€ Â U‚‚‚    €V € B€Â EB FBÖ€  \‚ NÍ€€ ÁÂ •ÂB€ € Z      entityList    GetMyPlayer 
   GetMyHero    poof 
   IsChanneling    Animations    CanMove    alive    IsInvul    IsAttackImmune    SleepCheck 	   -casting    visible    IsMagicImmune    ancient    classId    CDOTA_BaseNPC_Tower    CDOTA_BaseNPC_Creep_Siege    math    ceil    DamageTaken    dmgMin    dmgMax        @   DAMAGE_PHYS       đ?   DAMAGE_MAGC    GetSpecialData    radius    level    anyMeepoisNear      P”@      ř?   chainEarthbind    FindCastPoint š™™™™™Ů?   IsInvisible    creep    CDOTA_BaseNPC_Creep_Neutral    CDOTA_BaseNPC_Creep_Lane    GetAbility    canCast            willHit    camp    GetDistance2D 	   position       9@   state 
   SwitchTreads    CastAbility    Sleep      @Ź@   LuaEntityAbility 
   STATE_NOMANA    -move    getBlockPositions    rotR 
   SkillShot    __GetBlock       Y@   attackSpeed       i@   hero 	   IsRanged    CDOTA_BaseNPC_Barracks    CDOTA_BaseNPC_Building 	   activity 
   LuaEntityNPC    ACTIVITY_MOVE    isFacingAnyMeepo    Move    Follow 
   selection    handle    victim        $@   client    mousePosition    getBackswingTime    health 
   maxHealth       @      @
   lastState    useTP    -attack    Attack    GetAttackTime                                     S_FUqV8ěčĂž¶)ú|hMI=I”lnmlsTÜ1>}L)ä|hMJ=IŠlnmlmd9ě=,M|ÔLF}d
,y¤\·UJńyŻ  š* ”őŐćÇa•‰/â@Ť˘|hĽ¬EÂj¬˙şqŔ•˘˙†Őś¬đôÁ_k$ň÷Ô„
őÝCüu6–pE4-
